; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	image0 - mode
	infrared1 - mode
	GroundStation4 - direction
	GroundStation6 - direction
	Star7 - direction
	Star5 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation9 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Star10 - direction
	GroundStation8 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Star17 - direction
	Star18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star17)
	(supports instrument1 image0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 infrared1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star10)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star16)
	(supports instrument3 infrared1)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation8)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star16)
)
(:goal (and
	(pointing satellite2 Star13)
	(have_image Planet11 image0)
	(have_image Star12 image0)
	(have_image Star13 image0)
	(have_image Phenomenon14 image0)
	(have_image Phenomenon15 infrared1)
	(have_image Star16 image0)
	(have_image Star17 image0)
	(have_image Star18 image0)
	(have_image Planet19 infrared1)
))

)

; plan
1. (turn_to satellite2 groundstation8 star16)
   deleted: (pointing satellite2 star16)
   added: (pointing satellite2 groundstation8)
   goals met: 0 of 10
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 10
3. (calibrate satellite2 instrument3 groundstation8)
   added: (calibrated instrument3)
   goals met: 0 of 10
4. (turn_to satellite2 planet19 groundstation8)
   deleted: (pointing satellite2 groundstation8)
   added: (pointing satellite2 planet19)
   goals met: 0 of 10
5. (take_image satellite2 planet19 instrument3 infrared1)
   added: (have_image planet19 infrared1)
   goals met: 1 of 10
6. (turn_to satellite2 planet11 planet19)
   deleted: (pointing satellite2 planet19)
   added: (pointing satellite2 planet11)
   goals met: 1 of 10
7. (take_image satellite2 planet11 instrument3 image0)
   added: (have_image planet11 image0)
   goals met: 2 of 10
8. (turn_to satellite2 phenomenon15 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon15)
   goals met: 2 of 10
9. (take_image satellite2 phenomenon15 instrument3 infrared1)
   added: (have_image phenomenon15 infrared1)
   goals met: 3 of 10
10. (turn_to satellite2 phenomenon14 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 phenomenon14)
   goals met: 3 of 10
11. (take_image satellite2 phenomenon14 instrument3 image0)
   added: (have_image phenomenon14 image0)
   goals met: 4 of 10
12. (turn_to satellite2 star12 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 star12)
   goals met: 4 of 10
13. (take_image satellite2 star12 instrument3 image0)
   added: (have_image star12 image0)
   goals met: 5 of 10
14. (turn_to satellite2 star16 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star16)
   goals met: 5 of 10
15. (take_image satellite2 star16 instrument3 image0)
   added: (have_image star16 image0)
   goals met: 6 of 10
16. (turn_to satellite2 star17 star16)
   deleted: (pointing satellite2 star16)
   added: (pointing satellite2 star17)
   goals met: 6 of 10
17. (take_image satellite2 star17 instrument3 image0)
   added: (have_image star17 image0)
   goals met: 7 of 10
18. (turn_to satellite2 star18 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 star18)
   goals met: 7 of 10
19. (take_image satellite2 star18 instrument3 image0)
   added: (have_image star18 image0)
   goals met: 8 of 10
20. (turn_to satellite2 star13 star18)
   deleted: (pointing satellite2 star18)
   added: (pointing satellite2 star13)
   goals met: 9 of 10
21. (take_image satellite2 star13 instrument3 image0)
   added: (have_image star13 image0)
   goals met: 10 of 10
